export const questions = [
    {
      id: 1,
      text: "الرجاء اختيار الجنس",
      multiple: false,
      answers: [
        { id: 101, text: "ذكر" },
        { id: 102, text: "أنثى" }
      ],
    },
    {
      id: 2,
      text: "ما هو الهدف الرئيسي",
      multiple: true,
      answers: [
        { id: 201, text: "خسارة الوزن" },
        { id: 202, text: "تضخيم" },
        { id: 203, text: "تحسين عادات صحية" },
        { id: 204, text: "زيادة الحجم العضلي" },
        { id: 205, text: "خسارة الدهون" },
        { id: 206, text: "شد الجسم" },
        { id: 207, text: "رفع اللياقة البدنية" },
        { id: 208, text: "رفع اللياقة القلبية" },
        { id: 209, text: "زيادة الوزن" },
        { id: 210, text: "التحسين من العادات الصحية" },
        { id: 211, text: "زيادة المرونة" },
      ],
    },
    {
      id: 3,
      text: "أين تفضل أن تتمرن",
      multiple: false,
      answers: [
        { id: 301, text: "في المنزل" },
        { id: 302, text: "في النادي" },
      ],
    },
    {
      id: 4,
      text: "ما هو مستوى التمرين الذي تريده",
      multiple: false,
      answers: [
        { id: 401, text: "مبتدئ" },
        { id: 402, text: "متوسط" },
        { id: 403, text: "متقدم" },
      ],
    },
    {
      id: 5,
      text: "كيف تصنف هيكلك الجسدي",
      multiple: false,
      answers: [
        { id: 501, text: "نحيف" },
        { id: 502, text: "بنية متوسطة" },
        { id: 503, text: "جسم قوي وقصير" },
        { id: 505, text: "مترهل" },
        { id: 506, text: "طويل وسمين" },
        { id: 507, text: "قصير وسمين" },
        { id: 508, text: "سمين من المنطقة العلوية ونحيف من المنطقة السفلية" },
        { id: 509, text: "سمين من السفلية ونحيف من العلوية" },
        { id: 510, text: "سمين من الوسط ونحيف من العلوية  " },
        { id: 511, text: "نحيف من العلوية" },
      ],
    },
    {
      id: 6,
      text: "ما هو هدفك الجسدي",
      multiple: true,
      answers: [
        { id: 601, text: "أصغر بضع مقاسات" },
        { id: 602, text: "رياضي" },
        { id: 603, text: "مشدود العضلات" },
        { id: 604, text: "متضخم العضلات" },
        { id: 605, text: "مشدود الجسم" },
        { id: 606, text: "متناسق" },
      ],
    },
    {
      id: 7,
      text: "المناطق التي تستهدفها",
      multiple: true,
      answers: [
        { id: 701, text: "الأذرع" },
        { id: 702, text: "الصدر" },
        { id: 703, text: "الساقين" },
        { id: 704, text: "البطن" },
        { id: 705, text: "الظهر" },
        { id: 706, text: "الارداف" },
      ],
    },
    {
      id: 8,
      text: "صف تجربتك مع اللياقة البدنية",
      multiple: true,
      answers: [
        { id: 801, text: "أواجه صعوبة في زيادة الكتلة العضلية" },
        { id: 802, text: "أربح وأفقد الوزن دون مجهود" },
        { id: 803, text: "أزداد وزنا بسهولة لكن من الصعب أن أخسره" },
      ],
    },
    {
      id: 10,
      text: "كيف يكون جدول عملك",
      multiple: false,
      answers: [
        { id: 1001, text: "من التاسعة صباحا حتى الخامسة مساء" },
        { id: 1002, text: "ورديات ليلية" },
        { id: 1003, text: "ساعاتي مرنة" },
        { id: 1004, text: "متقاعد" },
      ],
    },
    {
      id: 11,
      text: "كيف تقضي يومك العادي",
      multiple: false,
      answers: [
        { id: 1101, text: "أقضي معظم اليوم جالسا" },
        { id: 1102, text: "لدي فترات نشاط بدني خلال اليوم" },
        { id: 1103, text: "أقضي معظم الوقت واقفا طوال اليوم" },
      ],
    },
    {
      id: 12,
      text: "كم مرة ترغب في ممارسة التمارين الرياضية",
      multiple: false,
      answers: [
        { id: 1201, text: "يوميا" },
        { id: 1202, text: "مرتين في الأسبوع" },
        { id: 1203, text: "3 مرات في الأسبوع" },
        { id: 1204, text: "4 مرات في الأسبوع" },
        { id: 1205, text: "5 مرات في الأسبوع" },
        { id: 1206, text: "6 مرات في الأسبوع" },
        { id: 1207, text: "7 مرات في الأسبوع" },
        { id: 1208, text: "لا أرغب في ممارسة التمارين الرياضية" },
      ],
    },
    {
      id: 13,
      text: "هل تشعر بالضيق عند صعود الدرج",
      multiple: false,
      answers: [
        { id: 1301, text: "ضيق شديد" },
        { id: 1302, text: "أشعر بالضيق إلى حد ما ولكن يمكنني التحدث" },
        { id: 1303, text: "أشعر بأنني بخير بعد صعود الدرج" },
        { id: 1304, text: "يسهل علي صعود العديد من الطوابق" },
      ],
    },
    {
      id: 15,
      text: "هل تعاني من حساسية (يرجى اختيار كل نوع تعاني منه)",
      multiple: true,
      answers: [
        { "id": 1531, "text": "لا يوجد لدي حساسية" },
        { "id": 1501, "text": "نعم، أعاني من حساسية الدجاج" },
        { "id": 1502, "text": "نعم، أعاني من حساسية السمك" },
        // { "id": 1503, "text": "نعم، أعاني من حساسية البيض" },
        { "id": 1504, "text": "نعم، أعاني من عدم تحمل الهيستامين" },
        // { "id": 1505, "text": "نعم، أعاني من حساسية السمسم" },
        { "id": 1506, "text": "نعم، أعاني من حساسية الصويا" },
        { "id": 1507, "text": "نعم، أعاني من حساسية من المكسرات" },
        { "id": 1509, "text": "نعم، أعاني من حساسية الألبان والحليب" },
        { "id": 1510, "text": "نعم، أعاني من حساسية الجلوتين" },
        // { "id": 1511, "text": "نعم، أعاني من حساسية اللاكتوز" },
        { "id": 1512, "text": "نعم، أعاني من حساسية الوبر (كيوي، دراق...)" },
        // { "id": 1513, "text": "نعم، أعاني من حساسية الأسماك والمأكولات البحرية" },
        { "id": 1514, "text": "نعم، أعاني من حساسية الفراولة" },
        { "id": 1528, "text": "نعم، أعاني من حساسية قمح" },
        { "id": 1530, "text": "نعم، أعاني من حساسية البقوليات" }
      ],
    },
    {
      id: 31,
      text: "ما المشاكل الصحية التي تعاني منها",
      multiple: true,
      answers: [
        { id: 3101, text: "أعاني من مرض السكري" },
        { id: 3102, text: "أعاني من ارتفاع ضغط الدم" },
        { id: 3103, text: "أعاني من نقرس" },
        { id: 3104, text: "أعاني من مشاكل هضمية" },
        { id: 3105, text: "لا أريد تواجد الألبان في البرنامج الغذائي" },
        { id: 3106, text: "أعاني من القولون" },
        { id: 3107, text: "أعاني من الصرع" },
        { id: 3108, text: "أعاني من السرطان" },
        { id: 3109, text: "أعاني من ارتفاع ضغط الدم" },
        { id: 3110, text: "أعاني من ارتفاع الكوليسترول" },
        { id: 3111, text: "أعاني من مشاكل الكلى (الحصوات)" },
        { id: 3112, text: "لا أعاني من أي مشاكل صحية" },
      ],
    },
    {
      id: 19,
      text: "هل تشعر بعدم ارتياح في المعدة خلال اليوم",
      multiple: false,
      answers: [
        { id: 1901, text: "نعم" },
        { id: 1902, text: "لا" },
      ],
    },
    {
      id: 24,
      text: "ما هو طولك",
      multiple: false,
      isText: true,
      isNumber:true,
      answers: [
        { id: 2401, text: "" }
      ],
    },
    {
      id: 25,
      text: "ما هو وزنك الحالي",
      multiple: false,
      isText: true,
      isNumber:true,
      answers: [
        { id: 2501, text: "" }
      ],
    },
    {
      id: 26,
      text: "ما هو وزنك المستهدف",
      multiple: false,
      isText: true,
      isNumber:true,
      answers: [
        { id: 2601, text: "" }
      ],
    },
    {
      id: 27,
      text: "كم عمرك",
      multiple: false,
      isText:true,
      isNumber:true,
      answers: [
        { id: 2701, text: "" }
      ],
    },
    {
      id: 28,
      text: "ما هي الدولة التي تتواجد فيها",
      multiple: false,
      isText: true,
      answers: [
        { id: 2801, text: "" }
      ],
    }, {
      id: 29,
      text: "كيف تصف وضعك المادي",
      multiple: false,
      answers: [
        { id: 2901, text: "مرتفع" },
        { id: 2902, text: "متوسط" },
        { id: 2903, text: "منخفض" }
  
      ],
    },{
      id: 30,
      text: "(يرجى اختيار الأطعمة التي تود تجنبها في نظامك الغذائي) ما هي الأطعمة التي لا ترغب بوجودها في برنامجك الغذائي",
      multiple: true,
      answers: [
        { id: 3001, text: "لا أريد تواجد الدجاج في البرنامج الغذائي" },
        { id: 3002, text: "لا أريد تواجد السمك في البرنامج الغذائي" },
        { id: 3003, text: "لا أريد تواجد اللحوم الحمراء في البرنامج الغذائي" },
        { id: 3004, text: "لا أريد تواجد الأطعمة المقلية في البرنامج الغذائي" },
        { id: 3005, text: "لا أريد تواجد الألبان في البرنامج الغذائي" },
        { id: 3006, text: "لا أريد تواجد الحبوب أو الغلوتين في البرنامج الغذائي" },
        { id: 3007, text: "لا أريد تواجد السكريات أو الحلويات في البرنامج الغذائي" },
        { id: 3008, text: "لا أريد تواجد أي طعام غير نباتي في البرنامج الغذائي" },
        { id: 3009, text: "لا أريد تواجد أي نوع من الأطعمة المعالجة أو المعلبة" },
        { id: 3010, text: "أريد تناول جميع الأطعمة" },
  
      ],
    },{
      id: 33,
      text: "كم عدد الوجبات التي ترغب بالحصول عليها خلال اليوم",
      multiple: false,
      answers: [
        { id: 3301, text: "فطور + سناك + غداء + سناك + عشاء" },
        { id: 3302, text:  "فطور + سناك + سناك + عشاء + سناك"  },
        { id: 3303, text: "فطور + غداء + عشاء" },
        { id: 3304, text: "فطور + غداء + سناك + سناك" }
      ],
    },
  ];
  